package ch04;
class Ex4_8 {
	public static void main(String args[]) {
		
		/*
		 * for문
		 * 반복문은 어떤 작업이 반복적으로 수행되도록 할 때 사용되며,
		 * 반복문의 종류로는 for문, while문, do-while문이 있다.
		 * 
		 * for문의 구조와 수행순서
		 * 초기화, 조건식, 증감식, 블럭 모두 4부분으로 이루어져 있다.
		 * 
		 * for(초기화;조건식;증감식){
		 * }
		 * 
		 * 조건식이 참인 동안 블럭{}내의 문장들을 반복하다가
		 * 거짓이 되면 반복문을 벗어난다.
		 * 
		 * 초기화
		 * 반복문에 사용될 변수를 초기화하는 부분이며 처음에 한번만 수행된다.
		 * 둘이상의 변수가 필요할 때는 같이 콤마','를 구분자로 변수를 초기화한다.
		 * 단, 두 변수의 타입은 같아야 한다.
		 * 
		 * 조건식
		 * 조건식의 값이 참이면 반복을 계속하고,
		 * 거짓이면 반복을 중단하고 for문을 벗어난다.
		 * 
		 * 증감식
		 * 반복문을 제어하는 변수의 값을 증가 또는 감소시키는 식이다.
		 * 매 반복마다 변수의 값이 증감식의 의해서 점진적으로 변하다가 
		 * 결국 조건식이 거짓이 되어 for문을 벗어나게 된다.
		 */
		for (int i = 1; i <= 3; i++) { // 괄호{}안의 문장을 3번 반복한다.
			System.out.println("Hello");
		}
	}
}