package ch03;
class Ex3_5 {
	public static void main(String[] args) {
		
		/*
		 * 형변환
		 * : 변수 또는 상수의 타입을 다른 타입으로 변환하는 것
		 * 
		 * 프로그램을 작성하다 보면 같은 타입뿐만 아니라,
		 * 서로 다른 타입 간의 연산을 수행해야 할 때 사용한다.
		 * 
		 * 
		 * (타입)피연산자
		 * 괄호() : '캐스트 연산자' 또는 '형변환 연산자' 라고 한다.
		 * 형변환   : '캐스팅(casting)' 이라고도 한다.
		 * 
		 * 자동 형변환
		 * : 기존의 값을 최대한 보존할 수 있는 타입으로 자동 형변환 된다.
		 * 
		 * 좁은 타입에서 넓은 타입으로 형변환 하는 경우에는 값 손실이 없으므로
		 * 두 타입 중에서 표현 범위가 더 넓은 쪽으로 형변환이 된다.
		 * 
		 */
		double d = 85.4;
		int score = (int) d;	// 형변환 후에도 피연산자에는 아무런 변화가 없다.
		System.out.println("score=" + score);
		System.out.println("d=" + d); 
	}
}